Repository: brainworxx/kreXX-TYPO3-Extension
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# mlang_labels_tabdescr
source: kreXX is a feature rich php debugger with a neatly arranged debug window, featuring backend access to logfiles, code generation to reach the displayed values and much more.
de: kreXX ist ein featurereicher PHP Debugger mit einer übersichtlichen Debug Ausgabe. Die Features umfassen einen Backendzugang zu seinen Logdateien, Quellcode Generierung um die dargestellten Werte zu erreichen und vieles mehr.

source: File
de: Datei

source: Browser immediately
de: Browser sofort

source: True
de: Wahr

source: False
de: Falsch

source: Save
de: Speichern

# simple
source: Simple mode
de: Einfacher Modus

# expert
source: Expert mode
de: Experten Modus

# clear.cookies
source: Reset local cookie settings
de: Browser Debugging Cookies löschen

# full
source: Full edit
de: Editierbar

# display
source: Display only
de: Nur anzeigen

# none
source: Do not display
de: Nicht anzeigen

# analyseProtected
source: Shall kreXX try to analyse the protected properties of a class? This may result in a lot of output.
de: Soll kreXX Protected Properties von Klassen analysieren? Das kann eine große Menge an Output bedeuten.

# analysePrivate
source: Shall kreXX try to analyse the private properties of a class? This may result in a lot of output.
de: Soll kreXX Private Properties von Klassen analysieren? Das kann eine große Menge an Output bedeuten.

# analyseScalar
source: Shall kreXX do a deep analysis for scalar types? We are handling XML, JSON, callbacks and filepath.
de: Soll kreXX eine fortgeschrittene Analyse von Skalaren Variablen machen? Unterstützt wird XML, JSON, Callbacks und Dateipfade.

# analyseTraversable
source: Shall kreXX try to analyse possible traversable data?
de: Soll kreXX versuchen iterierbare Klassendaten zu analysieren?

# debugMethods
source: Comma-separated list of used debug callback functions. A lot of frameworks offer these, toArray and toString being the most common. kreXX will try to call them, if they are available and display their provided data.
de: Komma separierte Liste mit zu benutzenden Debugfunktionen. Viele Frameworks bieten solche an, wobei toArray und toString die häufigst genutzen sind. kreXX wird versuchen diese aufzurufen falls sie zuer Verfügung stehen, und ihre Daten anzeigen.

# level
source: Most frameworks have objects inside of objects inside of objects, and so on. Normally kreXX does not run in circles, but going to deep inside of an object tree can result in a lot of output.
de: Die meisten Frameworks haben Objekte in Objekten, welche wieder Objekte haben, usw. Normalerweise hat kreXX keine Probleme mit Rekursionen, aber wenn man zu tief in Objektstrukturen vorstößt, erhält man auch jede Menge Output.

# destination
source: 'Browser shutdown phase' = Sending everything to the browser after TYPO3 is finished with everything. 'File' = Saving everything to the log folder. 'Browser immediately' = Sending everything to the browser right away.
de: 'Browser Shutdown Phase' = Es wird alles an den Browser geschickt, sobalt TYPO3 mit allem fertig ist. 'Datei' = Alles wird im Logordner gespeichert. 'Browser sofort' = Alles wird sofort an den Browser geschickt.

# maxCall
source: kreXX has no problem with creating 1 GB of output, your browser can certainly not handle this much HTML. When using kreXX in a loop, it will create output every time the loop is executed. To limit this, you can configure the maximum call settings.
de: kreXX hat kein Problem damit 1 GB an Output zu erzeugen, ein Webrowser wird damit aber nicht umgehen können. Wenn kreXX in einer Schleife eingesetzt wird, wird für jeden Durchlauf Output generiert. Um das einzuschränken kann hier angegeben werden, wie oft kreXX pro Request ausgeführt werden darf.

# disabled
source: Here you can disable kreXX without uninstalling the whole extension.
de: Hier kann man kreXX abschalten ohne die Extension deinstallieren zu müssen.

# maxfiles
source: How many logfiles do you want to store inside your logging folder? When there are more files than this number, the older files will get deleted.
de: Wie viele Logdateien soll kreXX im Logordner aufbewahren? Wenn es mehr gibt als hier angegeben ist, werden ältere Dateien gelöscht.

# skin
source: Choose a skin here. We have provided kreXX with two skins: smoky-grey and hans.
de: Hier kann ein Skin ausgewählt werden. kreXX bringt zwei skins mit: Smoky-Grey und Hans

# maxStepNumber
source: A backtrace tends to produce a lot of output, and browsers tend to have problems with more than 100MB output in HTML text. Normally it is not necessary to go back more than 10 steps, but if you need to, you can increase this number here.
de: Ein Backtrace hat die Angewohnheit sehr viel Output zu erzeugen, und Webbrowser haben die Angewohnheit Probleme mit mehr als 100 MB HTML Code zu haben. Normalerweise ist es nicht nötig weiter als die letzten 10 Steps zu analysieren. Aber falls es doch nötig ist, hier kann dieser Wert eingestellt werden.

# detectAjax
source: kreXX tries to detect whether a request is made via AJAX. When it is detected, it will not send any output to the browser at all, because an AJAX request hat most certainly no way of displaying the kreXX output. Logging is still possible of course. The AJAX detection can be disabled here.
de: kreXX versucht herauszufinden, ob ein Request per AJAX gemacht wurde. Es wird dann keine HTML an den Browser geschickt, weil ein AJAX Request damit nichts anfangen kann. Logging ist selbstverständlich möglich. Die AJAX Erkennung kann hier ausgeschaltet werden.

# memoryLeft
source: kreXX checks regularly how much memory is left. Here you can adjust the amount where it will trigger an emergency break. Unit of measurement is MB.
de: kreXX überprüft regelmäßig wie viel Speicher noch frei ist. Hier kann die Menge angegeben werden bevor ein Notstop ausgelöst wird. Die Maßeinheit ist MB.

# maxRuntime
source: kreXX checks during the analysis how much time has elapsed since start. Here you can adjust the amount where it will trigger an emergency break. Unit of measurement is seconds.
de: kreXX überprüft regelmäßig wie lange sein Start her ist. Hier kann die Zeit eingestellt werden bevor ein Notstop ausgelöst wird. Die Maßeinheit ist Sekunden.

# analyseProtectedMethods
source: Here you can toggle if kreXX shall analyse the protected methods of a class.
de: Hier kann eingestellt werden ob kreXX Protected Methoden von Klassen analysieren soll.

# analysePrivateMethods
source: Here you can toggle if kreXX shall analyse the private methods of a class.
de: Hier kann eingestellt werden ob kreXX Private Methoden einer Klasse analysieren soll.

# iprange
source: List of IPs that can trigger kreXX. Wildcards can be used.
de: IP Filter zum Aufrufen von kreXX. Wildcards können genutzt werden.

# analyseGetter
source: Shall kreXX try to determine the output of getter methods? These methods will not be called. kreXX will try to get the (possible) result from the class properties, which may lead to false results.
de: Soll kreXX versuchen die Ergebnisse von Getter-Methoden zu erraten? Diese Methoden werden nicht aufgerufen. kreXX wird versuchen die (möglichen) Werte aus den Klassen Properties zu zeihen, was zu falschen Ergebnissen führen kann.

# arrayCountLimit
source: When encountering an array larger than this number, kreXX will resort to a simplified array analysis. This means that classes or other arrays in this large array will only get a rudimentary analysis to prevent an overkill output.
de: Wenn kreXX auf einen sehr großen Array analysieren soll wird eine einfachere Array Analyse genutzt. Das bedeutet, dass Objekte oder andere Arrays welche darin enthalten sind nur rudimentär analysiert werden, um nicht zu viel Output zu erzeugen.

# activateT3FileWriter
source: Use kreXX as the TYPO3 log file writer?
de: Soll kreXX als TYPO3-Log-Writer eingesetzt werden?

# loglevelT3FileWriter
source: There are different log levels. Depending on the setting, you may get a lot of output.
de: Es gibt unterschiedliche Log-Level. Je nachdem was hier eingestellt wird kann das eine Menge Output erzeugen.

# file.not.writable
source: Configuration file %1$s is not writable!
de: Die Konfigurationsdatei %1$s kann nicht geschrieben werden.

# value.not.allowed
source: %1$s is not an allowed value!
de: Der Wert %1$s ist hier nicht erlaubt.

# save.fail.title
source: The settings were NOT saved.
de: Die Einstellungen wurden NICHT gespeichert.

# save.success.title
source: The settings were saved.
de: Die Einstellungen wurden gespeichert.

# save.success.text
source: The settings were saved to: %1$s
de: Die Einstellungen wurden hier gespeichert: %1$s

# general.error.title
source: General error
de: Allgemeiner Fehler

# debugpreset.warning.title
source: Productive Settings detected!
de: Produktiv-Einstellungen gefunden!

# debugpreset.warning.message
source: kreXX will function normally, but please do not debug a productive system.
de: kreXX wird normal funktionieren, aber bitte debuggen Sie kein Produktiv-System.

# fileDeleted
source: The file "%s" was successfully deleted.
de: Die Datei "%s" wurde erflogreich gelöscht.

# fileDeletedFail
source: The file "%s" was NOT deleted.
de: Die Datei "%s" wurde NICHT gelöscht.

source: Access denied!
de: Zugang verweigert!

# languageKey
source: The language key from the help file(s). We provide kreXX in two language english as a fall back, and german (de).
de: Der Sprachschlüssel für die Hilfedatei(en). kreXX wird in zwei Sprachen ausgeliefert, Englisch und Deutsch (de).

# configErrorBool
source: Wrong configuration for: '%s => %s'! Expected boolean. The configured setting was not applied!
de: Falsche Konfiguration für: '%s => %s'! Boolean erwartet. Dieses Setting wurde nicht angewendet!

# configErrorInt
source: Wrong configuration for: '%s => %s'! Expected integer. The configured setting was not applied!
de: Falsche Konfiguration für: '%s => %s'! Integer erwartet. Dieses Setting wurde nicht angewendet!

# configErrorDestination
source: Wrong configuration for: 'output => destination'! Expected 'browser', 'file' or 'browserImmediately'. The configured setting was not applied!
de: Falsche Konfiguration für:'output => destination'! Zulässige Werte sind 'browser', 'file' oder 'browserImmediately'. Dieses Setting wurde nicht angewendet!

# configErrorSkin
source: Wrong configuration for: 'output => skin'! Skin not found. The configured setting was not applied!
de: Falsche Konfiguration für: 'output => skin'! Der Skin wurde nicht gefunden. Dieses Setting wurde nicht angewendet!

# configErrorLocal
source: Could not read the Local Cookie configuration. Sorry :-/
de: Konnte die Browser Debugging Cookies nicht lesen. Sorry :-/

# configErrorIprange
source: Wrong configuration for: 'output => iprange'! An empty IP list means that no one will be able to use kreXX. The configured setting was not applied!
de: Falsche Konfiguration für: 'output => iprange'! Eine leere IP Liste bedeutet, dass niemand kreXX zu sehen bekommt. Dieses Setting wurde nicht angewendet!

# configErrorMaxRuntimeBig
source: Wrong configuration for: 'runtime => maxRuntime'! Maximum for this server is: %s. The configured setting was not applied!
de: Falsche Konfiguration für: 'runtime => maxRuntime'! Das Maximum für diesen Server beträgt: %s. Dieses Setting wurde nicht angewendet!

# maxCallReached
source: Maximum call-level reached. This is the last analysis for this request. To increase this value, please edit: emergency => maxCall.
de: Maximales Aufruflimit erreicht. Dies ist die letzte Analyse dieses Requests. Um diesen Wert zu erhöhen, bitte emergency => maxCall anpassen.

# configErrorDebugBlacklist
source: Wrong configuration for: '%s => %s'! The debugmethod '%s' is blacklisted. The configured setting was not applied!
de: Falsche Konfiguration für: '%s => %s'! Die Debugmethode '%s' ist geblacklistet. Dieses Setting wurde nicht angewendet!

# configErrorDebugInvalid
source: Wrong configuration for: '%s => %s'! '%s' is not a valid method. The configured setting was not applied!
de: Falsche Konfiguration für: '%s => %s'! '%s' ist keine valide Methode. Dieses Setting wurde nicht angewendet!

# configErrorLoglevelT3FileWriter
source: Wrong configuration for: 'TYPO3 => activateT3FileWriter'! '%s' is not a valid logging level. The configured setting was not applied!
de: Falsche Konfiguration für: 'TYPO3 => activateT3FileWriter'! '%s' ist kein valides Loglevel. Dieses Setting wurde nicht angewendet!

# emergencyTimer
source: Emergency break due to extensive run time!
de: Notstop wegen exzessiver Laufzeit!

# emergencyMemory
source: Emergency break due to extensive memory usage!
de: Notstop wegen zu hoher Speicherauslastung!

# fileserviceDelete
source: Unable to delete file: %s
de: Datei kann nicht gelöscht werden: %s

# fileserviceAccess
source: Could not access file: %s
de: Auf Dtei kann nicht zugegriffen werden: %s

# omittedBacktrace
source: Omitted backtrace steps %s until %s.
de: Ausgelassene Backtrace Schritte von %s bis %s.

# chunksNotWritable
source: Chunksfolder %s is not writable! This will increase the memory usage of kreXX significantly!
de: Der Chunksordner %s ist schreibgeschützt! Das wird erhöht die Speicherauslastung von kreXX erheblich.

# logNotWritable
source: Logfolder %s is not writable!
de: Der Logordner %s ist schreibgeschützt!

# fileinfoNotInstalled
source: The PHP extension 'fileinfo' is not installed. The mime type analysis is not available.
de: Die PHP Extension 'fineinfo' ist nicht installiert. Die Mimetype Analyse steht nicht zur Verfügung.

# mbstringNotInstalled
source: The php extension 'mb-string' is not installed. The string analysis may be unreliable.
de: Die PHP Extension 'mb-string' ist nicht installiert. Die String Analyse ist deswegen unzuverlässig.

# configErrorLangInvalid
source: Wrong configuration for: '%s => %s'! The language '%s' is not available. The configured setting was not applied!
de: Falsche Konfiguration für: '%s => %s'! Die Sprache '%s' steht nicht zur Verfügung. Dieses Setting wurde nicht angewendet!

# maximumLevelReached1
source: Maximale Verschachtelung erreicht..
de: Maximale Verschachtelungsebene für die Analyse erreicht. Ich werde nicht weiter gehen.

# maximumLevelReached2
source: To increase this value, change the Prune output => level setting."
de: Um diesen Wert zu erhöhen muss der Wert 'Ausgabe begrenzen => Maximale Verschachtelung' erhöht werden.

# layout.edit.config.file
source: Edit configuration file
de: Konfigurationsdatei editieren

# layout.edit.config.fe
source: Edit FE configuration
de: Frontend Konfiguration editieren

# layout.usage.help
source: Usage help
de: Schnelleinführung

# layout.log.index
source: Logfiles access
de: Logdateien Zugriff

# subhead.behavior
source: Behavior
de: Verhalten

# subhead.methods
source: Methods
de: Methoden

# subhead.pruneOutput
source: Prune output
de: Ausgabe begrenzen

# subhead.emergencystop
source: Emergency stop
de: Notstop

# subhead.typo3
source: TYPO3 specific
de: TYPO3 spezifisches

# table.desc
source: Description
de: Beschreibung

# table.value
source: Value
de: Wert

# label.memoryLeft
source: Minimum amount of memory [MB]:
de: Minimal genutzer Speicher [MB]:

# label.maxRuntime
source: Maximum Runtime [Seconds]:
de: Maximale Laufzeit [Sekunden]:

# label.maxfiles
source: Maximum files in the logfolder:
de: Maximale Anzahl von Dateien im Logverzeichnis:

# label.destination
source: Destination:
de: Ziel:

# label.maxCall
source: Maximum amount of calls:
de: Maximale Anzahl an Aufrufen:

# label.disabled
source: Disable kreXX:
de: kreXX abschalten

# label.detectAjax
source: Try to detect AJAX requests:
de: Versuche AJAX Requests zu erkennen:

# label.analyseProtected
source: Analyse protected properties:
de: Analysiere Protected Properties:

# label.analysePrivate
source: Analyse private properties:
de: Analysiere Private Properties:

# label.analyseScalar
source: Deep analysis for scalar types:
de: Fortgeschrittene analyse für skalare Variablen:

# label.analyseTraversable
source: Analyse traversable data:
de: Analyse von iterierbaren Klassendaten

# label.debugMethods
source: List of debug methods to poll for data:
de: Lise von verwendeten Debug Methoden:

# label.level
source: Maximum nesting level for objects and arrays:
de: Maximale Verschachtelungsebene für Objekte und Arrays:

# label.analyseProtectedMethods
source: Analyse protected methods:
de: Analysiere Protected Methoden:

# label.analysePrivateMethods
source: Analyse private methods:
de: Analysiere Private Methoden:

# label.iprange
source: IP Range:
de: IP Liste:

# label.analyseGetter
source: Analyse getter methods:
de: Analysiere Getter Methoden:

# label.maxStepNumber
source: Maximum steps in the backtrace:
de: Maximale Schritte in einem Backtrace:

# label.arrayCountLimit
source: Maximum array size before fallback to simplified analysis:
de: Maximal Array Größe vor dem Fallback auf die vereinfachte Analyse:

# label.activateT3FileWriter
source: Activate the TYPO3 FileWriter:
de: Den TYPO3 FileWriter aktivieren:

# label.loglevelT3FileWriter
source: Log level of the FileWriter:
de: Loglevel für den FileWriter:

# label.languageKey
source: Language
de: Sprache

# editfeconfig.help.headline
source: Here you can edit the frontend configuration form.
de: Hier kann die Frontend Konfiguration editiert werden.

# full.help
source: = The value can be edited in the frontend.
de: = Der Wert kann im Frontend editiert werden.

# display.help
source: = The value will only be displayed. kreXX will not accept any value for it.
de: = Der Wert wird lediglich angezeigt. kreXX wird keine Werte für diese Konfiguration akzeptieren oder anwenden.

# none.help
source: = kreXX will not display the value or accept any values for it.
de: = kreXX wird den Wert nicht anzeigen und auch keine Werte dafür akzeptieren oder anwenden.

# logging.noteditable
source: This setting is not editable on the frontend.
de: Dieses Setting ist im Frontend nicht editierbar.

# usage.headline
source: Usage PHP
de: Einsatz in PHP

# usage.label.calling
source: kreXX will be called in the PHP source code:
de: So wird kreXX im PHP Code aufgerufen:

# usage.features
source: Most of the time you will use this method. kreXX will analyse the $object and give you detailed information about it:
de: Meistens wird diese Methode genutzt. kreXX wird das $objct analysieren und detailierte Informationen dazu ausgeben:

# usage.features.1
source: Public properties of the object
de: Public Properties des Objektes

# usage.features.2
source: Protected properties of the object (can be toggled)
de: Protected Properties des Objektes (kann umgeschaltet werden)

# usage.features.3
source: Private properties of the object (can be toggled)
de: Private Properties eines Objektes (kann umgeschaltet werden)

# usage.features.4
source: Content of the traversable part of the object (can be toggled)
de: Inhalt des iterierbaren Teils des Objektes (kann umgeschaltet werden)

# usage.features.5
source: Result of all configured debugging methods (can be configured)
de: Ergebnis aller konfigurierbaren Debug Methoden (kann umgeschaltet werden)

# usage.features.simple
source: In case the variable is not an object, it will simply display its content.
de: Falls es sich nicht um ein Objekt handelt wird einfach der Inhalt ausgegeben.

# usage.label.moment
source: Define a "moment" during a benchmark test. The $string should be something meaningful, like "Model invoice db call":
de: Definiere einen "Moment" während eines Benchmark-Testes. Der $string sollte eine Bedeutung haben, z.B. "Model invoice db call".

# usage.label.timerEnd
source: End the benchmark test and displays the result:
de: Ende des Benchmark-Testes und Ausgabe des Ergebnisses:

# usage.label.backtrace
source: Outputs backtrace with sourcecode. When kreXX finds objects inside the backtrace, it will analyse them:
de: Ausgabe eines Backtraces mit Quellcode. Wen kreXX Objekte im Backtracfe findet werden diese ebenfalls analysiert.

# usage.links.headline
source: More datailed help
de: Ausführlichere Hilfe

# usage.links.typo3
source: Documentation at TYPO3 Docs
de: Dokumentation bei den TYPO3 Docs

# usage.links.github
source: Documentation at GitHub
de: Dokumentation auf GitHub

# usage.headline.fluid
source: Usage Fluid
de: Einsatz in Fluid

# usage.label.fluidnormal
source: Calling the ViewHelper is pretty much straight forward.
de: Der Aufruf des ViewHelpers ist relativ einfach.

# usage.label.fluidvalue
source: Use this part if you don't want fluid to escape your string or if you are stitching together an array.
de: So kann verhindert werden, dass Fluid einen String escaped, oder einen zusammengesetzten Array als Text rendert.

# usage.label.fluidmoment
source: kreXX measures the time between every call, and then outputs it as a benchmark.
de: kreXX misst die Zeit zwischen jedem Aufruf und gibt sie als Benchmark aus.

# usage.code.fluidmoment
source: Start the timer
de: Starte den Timer

# usage.code.fluidmoment.1
source: Start rendering
de: Starte das Rendering

# usage.code.fluidmoment.2
source: A lot more template code
de: Einiges an Template Code

# usage.code.fluidmoment.3
source: Take another moment
de: Zwischenstop für den Timer festlegen

# usage.code.fluidmoment.4
source: Start menu rendering
de: Starte das Menü Rendering

# usage.code.fluidmoment.5
source: Even more template code
de: Noch mehr Template Code

# usage.code.fluidmoment.6
source: Output the benchmark
de: Beende den Timer, und gebe das ergebnis aus.

# log.filename
source: Filename
de: Dateiname

# log.time
source: Last modified
de: Änd.-Datum

# log.size
source: Size
de: Größe

# log.fileerror
source: Error reading logfile
de: Fehler beim Lesen der Logdatei

# log.notreadable
source: File %1$s is not readable!
de: Datei %1$s ist nicht lesbar!

# log.meta
source: Metadata
de: Metadaten

# log.noresult
source: Sorry, there are currently no logfiles.
de: Es gibt leider noch keine Logdateien.

# ajax.delete.file
source: Delete this file?
de: Die Datei löschen?

# ajax.error
source: Error while parsing the server answer.
de: Die Serverantwort konnte nicht geparst werden.

# ajax.line
source: line
de: Zeile

# ajax.updated.loglist
source: Updated the log-list!
de: Die Logliste wurde aktualisiert.

# ajax.deleted.cookies
source: All cookie settings were removed!
de: Alle Debug-Cookie Einstellungen wurden entfernt.
